Tugas 2/results/testing.txt/.ipynb_checkpoints/ab-500-1-testing.txt-checkpoint.txt
This is ApacheBench, Version 2.3 <$Revision: 1843412 $>
Copyright 1996 Adam Twiss, Zeus Technology Ltd, http://www.zeustech.net/
Licensed to The Apache Software Foundation, http://www.apache.org/

Benchmarking 172.16.16.101 (be patient)
Completed 100 requests
Completed 200 requests
Completed 300 requests
Completed 400 requests
Completed 500 requests
Finished 500 requests


Server Software:        myserver/1.0
Server Hostname:        172.16.16.101
Server Port:            8889

Document Path:          /testing.txt
Document Length:        22 bytes

Concurrency Level:      1
Time taken for tests:   410.663 seconds
Complete requests:      500
Failed requests:        0
Total transferred:      79500 bytes
HTML transferred:       11000 bytes
Requests per second:    1.22 [#/sec] (mean)
Time per request:       821.326 [ms] (mean)
Time per request:       821.326 [ms] (mean, across all concurrent requests)
Transfer rate:          0.19 [Kbytes/sec] received

Connection Times (ms)
              min  mean[+/-sd] median   max
Connect:        0    0   0.1      0       3
Processing:   238  821 327.4    767    2438
Waiting:      238  794 315.9    747    2407
Total:        238  821 327.5    767    2438

Percentage of the requests served within a certain time (ms)
  50%    767
  66%    922
  75%   1013
  80%   1069
  90%   1233
  95%   1387
  98%   1658
  99%   1922
 100%   2438 (longest request)