Tugas 2/results/testing.txt/.ipynb_checkpoints/ab-500-5-testing.txt-checkpoint.txt
This is ApacheBench, Version 2.3 <$Revision: 1843412 $>
Copyright 1996 Adam Twiss, Zeus Technology Ltd, http://www.zeustech.net/
Licensed to The Apache Software Foundation, http://www.apache.org/

Benchmarking 172.16.16.101 (be patient)
Completed 100 requests
Completed 200 requests
Completed 300 requests
Completed 400 requests
Completed 500 requests
Finished 500 requests


Server Software:        myserver/1.0
Server Hostname:        172.16.16.101
Server Port:            8889

Document Path:          /testing.txt
Document Length:        22 bytes

Concurrency Level:      5
Time taken for tests:   222.244 seconds
Complete requests:      500
Failed requests:        0
Total transferred:      79500 bytes
HTML transferred:       11000 bytes
Requests per second:    2.25 [#/sec] (mean)
Time per request:       2222.441 [ms] (mean)
Time per request:       444.488 [ms] (mean, across all concurrent requests)
Transfer rate:          0.35 [Kbytes/sec] received

Connection Times (ms)
              min  mean[+/-sd] median   max
Connect:        0   13 114.8      0    1080
Processing:   592 2189 652.8   2131    4262
Waiting:      533 2125 638.4   2070    4219
Total:        592 2202 663.2   2149    4352

Percentage of the requests served within a certain time (ms)
  50%   2149
  66%   2426
  75%   2629
  80%   2737
  90%   3080
  95%   3388
  98%   3863
  99%   4209
 100%   4352 (longest request)